IDEA StatiCa Open Model
BeamDataEc2.CheckLimitDeflection Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 indicator for check of limit deflection for beam span
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool CheckLimitDeflection { get; set; }
Public Property CheckLimitDeflection As Boolean
	Get
	Set
public:
property bool CheckLimitDeflection {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace